
## Plan Result




<pre><code>Plan: 0 to add, 7 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.ecm-database.azurerm_resource_group.data-resourcegroup
  * module.ecm-database.azurerm_template_deployment.postgres-paas
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key-vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "environment"  = "aat"
          - "lastUpdated"  = "2022-11-02T12:45:03Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecm-database.data.azurerm_postgresql_server.replica will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_postgresql_server" "replica"  {
      ~ administrator_login = "ecmconsumer" -> (known after apply)
      ~ fqdn                = "ethos-shared-ecm-db-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/ethos-shared-ecm-db-aat" -> (known after apply)
      ~ identity            = [] -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ethos-shared-ecm-db-aat"
      ~ sku_name            = "GP_Gen5_2" -> (known after apply)
      ~ tags                = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "environment"  = "aat"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
      ~ version             = "11" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ecm-database.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat"
        name     = "ethos-shared-ecm-db-data-aat"
      ~ tags     = {
          + "application"  = "ethos"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.ecm-database.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat/providers/Microsoft.Resources/deployments/ethos-shared-ecm-db-aat"
        name                = "ethos-shared-ecm-db-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJEZXN0cm95IE1lIjoiTm8iLCJUZWFtIENvbnRhY3QiOiIjZXRob3MtcmVwbC1zZXJ2aWNlIiwiZW52aXJvbm1lbnQiOiJhYXQiLCJtYW5hZ2VkQnkiOiJFQ00gUHJvamVjdCJ9" -> "eyJEZXN0cm95IE1lIjoiTm8iLCJUZWFtIENvbnRhY3QiOiIjZXRob3MtcmVwbC1zZXJ2aWNlIiwiYXBwbGljYXRpb24iOiJldGhvcyIsImVudmlyb25tZW50IjoiYWF0IiwibWFuYWdlZEJ5IjoiRUNNIFByb2plY3QifQ=="
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
        name                            = "ethos-shared-aat"
      ~ tags                            = {
          + "application"  = "ethos"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/objectId/414c132d-5160-42b3-bbff-43a2e1daafcf"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ethos-aat-mi"
        name                = "ethos-aat-mi"
      ~ tags                = {
          + "application"  = "ethos"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }

  # module.queue-namespace.azurerm_servicebus_namespace.servicebus_namespace has changed
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat"
        name                                = "ethos-servicebus-aat"
      ~ tags                                = {
          + "application"  = "ethos"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"","Vars":{}} -->